MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB108/mcu.h
/* U1CNFG2 */
#define _UTRDIS U1CNFG2bits.UTRDIS
#define _UVCMPDIS U1CNFG2bits.UVCMPDIS
#define _UVBUSDIS U1CNFG2bits.UVBUSDIS
#define _EXTI2CEN U1CNFG2bits.EXTI2CEN

/* U1EP0 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
#define _RETRYDIS U1EP0bits.RETRYDIS
#define _LSPD U1EP0bits.LSPD
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */
#define _LOWSPD U1EP0bits.LOWSPD

/* U1EP1 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP2 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP3 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP4 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP5 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP6 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP7 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP8 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP9 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

